{"scenario": {
  "content": [
    {
      "id": "n_0",
      "title": "ПРЕДИСЛОВИЕ",
      "plot": "С недавних пор враг то и дело стал нарушать покой некогда безмятежного королевства Элгариол, ставшего со временем лишь затерянным островком в бурном и неспокойном океане Черной магии. Сначала только чудом удалось предотвратить вторжение с юга зеленых рыцарей, гоблинов и орков, выполнявших волю могущественного мага Барлада Дэрта. И вот уже грозит новая опасность — теперь с востока. Издалека, из-за горной цепи Лонсам и Мортлэндских топей, стали доходить до Элгариола слухи о новом чародее, сильнее и коварнее прежнего.\nУзнав об этом, придворный астролог и советник Короля магистр Белой магии Майлин отправил на восток своих разведчиков — огромных кондоров. Они способны без устали пролететь за день сотни миль и многое увидеть, оставаясь незамеченными. Вернувшись, птицы рассказали, что по ту сторону гор лежит бескрайняя пустыня, над которой высится одинокая скала. На многие мили вокруг не встретили они ни человека, ни зверя, но Зло исходит именно от этой скалы. На следующий день все кондоры погибли, бросившись из поднебесья на землю со сложенными крыльями.\nСобрав воедино все подвластное ему волшебство, Майлин смог понять, что случилось с несчастными птицами. На третий день полета, когда, по всем расчетам, они должны были находиться над той самой скалой, кондоры получили огромной силы мысленный приказ: вернуться назад и покончить с собой. Враг не учел только одного — разведчики достигли Элгариола быстрее, чем он рассчитывал.\nВсякий раз, когда захватчики посягали на земли Элгариола, кроме храбрых воинов защитой ему была и Белая магия. Теперь же возникло опасение, что даже Майлин не сможет противостоять новому Врагу. Только настоящий герой и только в одиночку мог бы проникнуть в логово Врага незамеченным, и Король попросил своего советника найти ему такого человека.\nЕсли вы готовы сражаться на стороне Добра против Зла, если не привыкли отступать на полпути и не испугаетесь встречи с Черной магией, то вы именно тот человек, который и нужен Королю Элгариола.\nО силе и храбрости Врага почти ничего не известно. Чтобы добраться до пустыни, придется либо переходить горы Лонсам, либо пробираться через Мортлэндские топи. Ни один житель Элгариола не заходил так далеко, поэтому карту вам придется рисовать самим,— если удастся вернуться назад живыми, она будет бесценна для жителей королевства.\nВсе, чем может помочь Майлин,— это дать вам оружие, при помощи которого можно будет сразиться с Врагом. Раз тот пользуется телепатией, то и вам придется тренировать свою Силу мысли. Однако время торопит, и в совершенстве овладеть умением отдавать мысленные приказы вы, конечно, не успеете. Когда придет время отправиться в путь, ваша Сила мысли будет равна лишь 3, но каждая новая победа будет прибавлять уверенности в себе и умения, повышая ваши телепатические способности.\nПуть долог, и вы берете с собой лишь самое необходимое: меч, на три дня еды в заплечном мешке да еще 15 золотых из оскудевшей в последнее время королевской казны.\nЧерез два дня пути по Главному Восточному тракту вы подходите к границе Элгариола. Здесь королевские владения заканчиваются, дальше вам придется полагаться только на себя. Если вы готовы пройти нехожеными тропами и испытать на себе всю силу Врага, не потеряв надежды выйти победителем, то переверните страницу, и да сопутствует вам удача!\n",
      "actions": [
        {
          "text": "далее",
          "gotoId": "#n_1",
          "when": ""
        }
      ]
    },
    {
      "id": "n_1",
      "title": "1",
      "plot": "Плодородные земли Элгариола позади. Перед вами пустыня. Вряд ли удастся обнаружить здесь тропинку, а тем более какую-нибудь дорогу, так что придется ориентироваться только по солнцу. Одинокая гора должна быть где-то на востоке, но стоит ли отправляться туда сразу? В деревушке, раскинувшейся у самого края пустыни, вы узнали, что древний караванный путь уходит на юго-восток. Там могут даже встретиться еще не пересохшие оазисы. Путь на северо-восток ведет к горам Лонсам. Куда направитесь вы?\n",
      "actions": [
        {
          "text": "На северо-восток",
          "gotoId": "#n_2",
          "when": ""
        },
        {
          "text": "На юго-восток",
          "gotoId": "#n_17",
          "when": ""
        }
      ]
    },
    {
      "id": "n_2",
      "title": "2",
      "plot": "Трактир оказывается на удивление уютным. Всего за 2 золотых вас обильно и сытно кормят (можете восстановить 4 СИЛЫ), после чего вы уютно располагаетесь в углу, чувствуя приятную истому от покоя и тяжести в желудке. Интересно все же послушать, чем живет этот забытый богами уголок мира. Ведь трактир, да еще и рядом с постоялым двором, здесь, как и везде, куда вас забрасывала судьба, один из центров деревенской жизни, где можно услышать последние новости с разных сторон света. А информация сейчас совсем бы не помешала. Где-то впереди должны быть Мортлэндские топи, и неплохо бы знать, можно ли вообще через них пробраться. Зал все больше заполняется народом, и вскоре выделяются три группы людей. Одна из них окружила бродячего певца, другая — торговца из какой-то неведомой вам страны. Третья больше всего напоминает кучку головорезов, собравшихся в противоположном от вас углу. К кому присоединитесь вы? К тем, кто слушает певца, торговца, или подойдете к разбойникам? \n",
      "actions": [
        {
          "text": "купить еды",
          "effect": "inventory.gold-2,character.strength+4,scenario.buying_food=1"
        },
        {
          "text": "певца",
          "gotoId": "#n_4",
          "when": ""
        },
        {
          "text": "торговца",
          "gotoId": "#n_19",
          "when": ""
        },
        {
          "text": "к разбойникам",
          "gotoId": "#n_5",
          "when": ""
        }
      ]
    },
    {
      "id": "n_3",
      "title": "3",
      "plot": "Как ни странно, даже в степи вам удается встретить какого-то путника. Сначала вдали поднимается облако пыли, потом в центре его становится видна черная точка. Судя по тому, что она приближается очень медленно, кто-то направляется вам навстречу пешком. Вскоре становятся видны даже очертания человеческой фигуры. Можете попробовать свернуть, чтобы избежать встречи, направившись на юг или на северо-восток, а можете продолжить свой путь.\n",
      "actions": [
        {
          "text": "на юг",
          "gotoId": "#n_7",
          "when": ""
        },
        {
          "text": "на северо-восток",
          "gotoId": "#n_2",
          "when": ""
        },
        {
          "text": "продолжить путь",
          "gotoId": "#n_16",
          "when": ""
        }
      ]
    },
    {
      "id": "n_4",
      "title": "4",
      "plot": "В это время года ночью в степи достаточно тепло, и вы спокойно спите до утра. Первое, что вы видите проснувшись — несколько небольших зверьков, копошащихся на остатках вашего заплечного мешка. За ночь суслики прогрызли его, съели всю еду (если она у вас еще оставалась) и куда-то утащили одну из вещей (на ваш выбор и если, конечно, они были). Но самая главная потеря — сам заплечный мешок. В карманах поместятся только две вещи, а все остальное придется оставить. Послав бессмысленные проклятия богу, вы продолжаете свой путь. Теперь он лежит  на юг.\n",
      "actions": [
        {
          "text": "пропала еда",
          "effect": "inventory.food=0"
        },
        {
          "text": "пропал(а) {x}",
          "effect": "inventory.loseOne(x)"
        },
        {
          "text": "только две вещи",
          "effect": "inventory.itemLimit=2"
        },
        {
          "text": "на юг",
          "gotoId": "#n_3",
          "when": ""
        }
      ]
    },
    {
      "id": "n_5",
      "title": "5",
      "plot": "Кажется, дорога через пустыню подходит к концу, впереди уже видны покрытые снегом пики Лонсама, а несколько отрогов хищными лапами тянутся вам навстречу. Огорчает только одно — как оказывается впоследствии, Шуликуны все же сыграли с вами злую шутку, украв одну из вещей из вашего заплечного мешка (если там ничего нет, кроме еды, то 1 ЕДУ). К вечеру горы уже нависают над вами. Стоит подумать о ночлеге. И вот, как будто отклик на ваши мысли,— у подножия горы прилепилась небольшая хижина. Может быть, ее обитателю ведомы кратчайшие пути через горы? Хотите войти и узнать, кто живет в хижине, или решите не рисковать? Если нет, то куда вы направитесь дальше: на север или на юг?\n",
      "actions": [
        {
          "text": "пропал(а) {x}",
          "effect": "inventory.loseOne(x) || inventory.lose('food',1)"
        },
        {
          "text": "узнать, кто в хижине",
          "gotoId": "#n_4",
          "when": ""
        },
        {
          "text": "на север",
          "gotoId": "#n_6",
          "when": ""
        },
        {
          "text": "на юг",
          "gotoId": "#n_7",
          "when": ""
        }
      ]
    },
    {
      "id": "n_6",
      "title": "6",
      "plot": "Вот уже несколько сот ступеней позади, еще три-четыре площадки, и дойдете до конца. Внезапно что-то острое касается вашей груди и голос, который кажется голосом самой величественной лестницы, настолько он властный и глубокий, спрашивает: «Кто ты, осмелившийся потревожить покой Вечных ступеней?» Решение надо принимать как можно быстрее. Ответите, что ищете хозяина скалы, назоветесь любопытным путешественником, пойдете дальше или воспользуетесь своей Силой мысли.\n",
      "actions": [
        {
          "text": "ищу хозяина скалы",
          "gotoId": "#n_8",
          "when": ""
        },
        {
          "text": "я путешественник",
          "gotoId": "#n_9",
          "when": ""
        },
        {
          "text": "пойду дальше",
          "gotoId": "#n_10",
          "when": ""
        },
        {
          "text": "атаковать силой мысли",
          "gotoId": "#n_11",
          "when": "character.thoughtPower == 3"
        },
        {
          "text": "атаковать силой мысли",
          "gotoId": "#n_12",
          "when": "character.thoughtPower == 4"
        },
        {
          "text": "атаковать силой мысли",
          "gotoId": "#n_13",
          "when": "character.thoughtPower == 5"
        },
        {
          "text": "атаковать силой мысли",
          "gotoId": "#n_14",
          "when": "character.thoughtPower == 6"
        },
        {
          "text": "атаковать силой мысли",
          "gotoId": "#n_15",
          "when": "character.thoughtPower == 7"
        },
        {
          "text": "атаковать силой мысли",
          "gotoId": "#n_16",
          "when": "character.thoughtPower == 8"
        },
        {
          "text": "атаковать силой мысли",
          "gotoId": "#n_17",
          "when": "character.thoughtPower == 9"
        }
      ]
    },
    {
      "id": "n_7",
      "title": "7",
      "plot": "Поверив в искренность паладина, вы рассказываете ему о своей задаче и спрашиваете, не случалось ли ему в своих странствиях пересекать Лонсам. Он отвечает, что был там около года назад. Если сейчас повернуть на север, а затем на восток, вы как раз окажетесь у начала тропы, которой он пользовался. Попрощавшись со случайным собеседником и поблагодарив его, решайте: пойдете на север или на восток.\n",
      "actions": [
        {
          "text": "на север",
          "gotoId": "#n_11",
          "when": ""
        },
        {
          "text": "на восток",
          "gotoId": "#n_12",
          "when": ""
        }
      ]
    },
    {
      "id": "n_8",
      "title": "8",
      "plot": "Вернувшись по тропинке, вы можете направиться либо на север, вдоль гор Лонсам, либо на юг вдоль топей в поисках иного пути?\n",
      "actions": [
        {
          "text": "на север",
          "gotoId": "#n_13",
          "when": ""
        },
        {
          "text": "на юг",
          "gotoId": "#n_14",
          "when": ""
        }
      ]
    },
    {
      "id": "n_9",
      "title": "9",
      "plot": "Хотя Голем и одушевлен, он не мыслит, а лишь выполняет приказания своих хозяев. Поэтому ваши попытки сразить его телепатическим ударом обречены на провал. (Если вы этого еще не делали), можете попробовать атаковать его с мечом в руке, поговорить с ним или же придумать какую-нибудь хитрость.\n",
      "actions": [
        {
          "text": "атаковать мечом",
          "gotoId": "#n_15",
          "when": ""
        },
        {
          "text": "поговорить",
          "gotoId": "#n_16",
          "when": ""
        },
        {
          "text": "хитрость",
          "gotoId": "#n_17",
          "when": ""
        }
      ]
    },
    {
      "id": "n_10",
      "title": "10",
      "plot": "Вы одержали победу и теперь сможете мысленно прозондировать каждое встречное разумное существо и узнать, враг это или нет. Исключение могут составлять только опытные телепаты, способные поставить барьер на пути вашего проникновения в их мысли, но ведь это само по себе уже будет говорить о многом. А теперь вернитесь на параграф, с которого вы сюда попали.\n",
      "actions": [
        {
          "text": "вернуться",
          "gotoId": "#back",
          "when": ""
        }
      ]
    },
    {
      "id": "n_11",
      "title": "11",
      "plot": "Через несколько часов ходьбы вдали появляется какое-то непонятное черное пятно, а к вечеру уже видно, что это горы — не слишком высокие, но достаточно непроходимые. Странно, ведь, по вашим расчетам, Лонсам должен быть много севернее. Смеркается, пора располагаться на ночлег. Ночи в пустыне более чем теплые, и вы укладываетесь спать прямо на песке, не рискуя подхватить простуду.\n",
      "actions": [
        {
          "text": "спать",
          "gotoId": "#n_18",
          "when": ""
        }
      ]
    },
    {
      "id": "n_12",
      "title": "12",
      "plot": "Нетрудно было догадаться, что перекати-поле вряд ли являются мыслящими существами. Ваша попытка не удается, а следующий шар заставляет потерять еще 4 СИЛЫ. Придется либо пытаться отбиться от следующего шара мечом, либо постараться увернуться.\n",
      "actions": [
        {
          "text": "урон",
          "effect": "character.strength-4"
        },
        {
          "text": "мечом",
          "gotoId": "#n_19",
          "when": ""
        },
        {
          "text": "увернуться",
          "gotoId": "#n_20",
          "when": ""
        }
      ]
    },
    {
      "id": "n_13",
      "title": "13",
      "plot": "Направившись на юг, стараетесь не терять из виду Лонсам, чтобы вернее держаться выбранного направления. Через некоторое время вы замечаете, что справа, вдалеке у подножия гор, виднеется какое-то селение. Хотите пойти к нему, дальше на юг или на юго-восток?\n",
      "actions": [
        {
          "text": "к селению",
          "gotoId": "#n_1",
          "when": ""
        },
        {
          "text": "на юг",
          "gotoId": "#n_2",
          "when": ""
        },
        {
          "text": "на юго-восток",
          "gotoId": "#n_3",
          "when": ""
        }
      ]
    },
    {
      "id": "n_14",
      "title": "14",
      "plot": "Судьба отвернулась от вас. Еще несколько взмахов руками, но восстановить равновесие так и не удается, и вы срываетесь вниз. Горы еще раз доказали, что с ними шутки плохи. Ваша миссия осталась невыполненной...\n",
      "actions": [
        {}
      ]
    },
    {
      "id": "n_15",
      "title": "15",
      "plot": "«Через горы есть три пути,— говорит Али бен-Су-лейман.— Один — трудный, но верный. Второй — рискованный, но бессмысленный. А третий — опасный, но глупый». Сколько вы ни просите после этого рассказать про эти три дороги поподробнее, статуя хранит безмолвие. А потом зовет слуг и приказывает проводить вас из оазиса, дав на дорогу 3 золотых.\n",
      "actions": [
        {
          "text": "+3 золота",
          "effect": "inventory.gold+3"
        },
        {
          "text": "далее",
          "gotoId": "#n_4",
          "when": ""
        }
      ]
    },
    {
      "id": "n_16",
      "title": "16",
      "plot": "(Посмотрите указанный параграф, не закрывая того, на котором находитесь.) После этого вы можете захотеть использовать какие-то из имеющихся или же из вновь открывшихся телепатических способностей. В противном случае можете продолжить подъем по лестнице или вспомнить о волшебных ножнах (если они у вас есть). А может быть, стоит задержаться и попробовать найти тело невидимого стража?\n",
      "actions": [
        {
          "text": "НЕВИДИМЫЙ СТРАЖ",
          "thoughtPower": "7",
          "strength": "12"
        },
        {
          "text": "+1 сила мысли",
          "effect": "character.thoughtPower+1"
        },
        {
          "gotoLink": "#n_5",
          "when": "character.thoughtPower == 4"
        },
        {
          "gotoLink": "#n_6",
          "when": "character.thoughtPower == 5"
        },
        {
          "gotoLink": "#n_7",
          "when": "character.thoughtPower == 6"
        },
        {
          "gotoLink": "#n_8",
          "when": "character.thoughtPower == 7"
        },
        {
          "gotoLink": "#n_9",
          "when": "character.thoughtPower == 8"
        },
        {
          "gotoLink": "#n_10",
          "when": "character.thoughtPower == 9"
        },
        {
          "gotoLink": "#n_11",
          "when": "character.thoughtPower == 10"
        },
        {
          "text": "телепатия",
          "gotoId": "#n_12",
          "when": "character.thoughtPower == 8"
        },
        {
          "text": "телепатия",
          "gotoId": "#n_13",
          "when": "character.thoughtPower == 9"
        },
        {
          "text": "телепатия",
          "gotoId": "#n_14",
          "when": "character.thoughtPower == 10"
        },
        {
          "text": "лестница",
          "gotoId": "#n_5",
          "when": ""
        },
        {
          "text": "волшебные ножны",
          "gotoId": "#n_6",
          "when": "inventory.magicScabbard == true"
        },
        {
          "text": "тело стража",
          "gotoId": "#n_7",
          "when": ""
        }
      ]
    },
    {
      "id": "n_17",
      "title": "17",
      "plot": "До самого вечера идете прямо на север, а потом настает время сделать привал. Ночью никто не беспокоит (можете восстановить 2 СИЛЫ), а утром надо решать: продолжите путь на север, повернете на восток, пойдете на северо-восток или на юго-восток?\n",
      "actions": [
        {
          "text": "+2 силы",
          "effect": "character.strength+2"
        },
        {
          "text": "на север",
          "gotoId": "#n_8",
          "when": ""
        },
        {
          "text": "на восток",
          "gotoId": "#n_9",
          "when": ""
        },
        {
          "text": "на северо-восток",
          "gotoId": "#n_10",
          "when": ""
        },
        {
          "text": "юго-восток",
          "gotoId": "#n_11",
          "when": ""
        }
      ]
    },
    {
      "id": "n_18",
      "title": "18",
      "plot": "От этого существа явно исходит сильная волна зла: есть над чем подумать.\n",
      "actions": [
        {
          "text": "подумать",
          "gotoId": "#n_12",
          "when": ""
        }
      ]
    },
    {
      "id": "n_19",
      "title": "19",
      "plot": "Достать меч не сложно, но вот в какую сторону направить удар? Рубанув прямо перед собой, слышите звон клинка о клинок, и острие, направленное вам в грудь, исчезает. Но где же враг? В это время откуда-то сбоку невидимый вражеский меч наносит первую рану (потеряйте 2 СИЛЫ).\n",
      "actions": [
        {
          "text": "-2 силы",
          "effect": "character.strength-2"
        },
        {
          "text": "использовать браслет с изумрудами",
          "gotoId": "#n_13",
          "when": "inventory.emeraldsBracelet == true"
        },
        {
          "text": "далее",
          "gotoId": "#n_14",
          "when": "inventory.emeraldsBracelet == false"
        }
      ]
    },
    {
      "id": "n_20",
      "title": "20",
      "plot": "Ночь приносит желанный отдых (можете восстановить 2 СИЛЫ), а утром решайте, куда идти дальше. На северо-восток или на юго-восток.\n",
      "actions": [
        {
          "text": "+2 силы",
          "effect": "character.strength+2"
        },
        {
          "text": "на северо-восток",
          "gotoId": "#n_15",
          "when": ""
        },
        {
          "text": "на юго-восток",
          "gotoId": "#n_16",
          "when": ""
        }
      ]
    }
  ]
}}